apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
/****************************************************************************
 * arch/arm/src/stm32h5/stm32_sdmmc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/kmalloc.h>
#include <nuttx/arch.h>
#include <nuttx/wdog.h>
#include <nuttx/clock.h>
#include <nuttx/compiler.h>
#include <nuttx/sdio.h>
#include <nuttx/wqueue.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/mmcsd.h>
#include <nuttx/irq.h>
#include <nuttx/cache.h>

#include <arch/board/board.h>

#include "chip.h"
#include "arm_internal.h"
#include "stm32_dma.h"
#include "stm32_gpio.h"
#include "stm32_rcc.h"
#include "stm32_sdmmc.h"

#if defined(CONFIG_STM32_SDMMC1) || defined(CONFIG_STM32_SDMMC2)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* HW Issues when not using IDMA
 *
 *    The FIFO lacks a FIFO data available interrupt. It only has a
 * FIFO Half Full and Full interrupt. Given that the FIFO size is 64
 * bytes (16 uint 32), this creates an issue for commands that read
 * less than 32 bytes hereafter referred to as a Lame FIFO.
 *
 * The DATAEND interrupt is only issued on the FIFO being emptied and it
 * appears the DTIMER does not start running again until the FIFO is read
 * so that DTIMEOUT interrupt can not be used to end the read operation.
 *
 * The only workaround is to use the IDMA to service the FIFO and to monitor
 * for a remainder in the FIFO that is less than FIFO_SIZE_IN_BYTES / 2.
 *
 * Therefore even when IDMA is not used, the IDMA still has to be used to
 * service the FIFO to receive less than FIFO_SIZE_IN_BYTES / 2 to a local
 * buffer. When the FIFO Half Full and Full interrupt do fire the FIFO will
 * be monitored off the an HP work thread for a residual of less than
 * FIFO_SIZE_IN_BYTES / 2.
 *
 * HW Issues when using IDMA
 *
 *    The DMA buffer must be located in a zone accessible via IDMA.
 * For SDMMC1, IDMA cannot access SRAM123. Refer to ST AN5200.
 * Buffer validity is checked when CONFIG_ARCH_HAVE_SDIO_PREFLIGHT is set.
 *
 * MDMA is only available on for SDMMC1 and Not supported at this time.
 *
 * Required system configuration options:
 *
 *   CONFIG_SCHED_WORKQUEUE -- Callback support requires work queue support.
 *
 * Driver-specific configuration options:
 *
 *   CONFIG_SDIO_MUXBUS - Setting this configuration enables some locking
 *     APIs to manage concurrent accesses on the SDMMC bus.  This is not
 *     needed for the simple case of a single SD card, for example.
 *   CONFIG_STM32_SDMMC_IDMA - Enable SDMMC IDMA.
 *     DMA support for SDMMC. If disabled, the SDMMC will work in
 *     interrupt mode and still use the IDMA to a local buffer for data
 *     lengths less the 32 bytes due to the FIFO limitations.
 *   CONFIG_SDMMC1/2_WIDTH_D1_ONLY - This may be selected to force the driver
 *     operate with only a single data line (the default is to use all
 *     4 SD data lines).
 *   CONFIG_STM32_SDMMC_XFRDEBUG - Enables some very low-level debug
 *     output This also requires CONFIG_DEBUG_FS and CONFIG_DEBUG_INFO
 *   CONFIG_SDMMC1/2_SDIO_MODE
 *     Build ins additional support needed only for SDIO cards (vs. SD memory
 *     cards)
 *   CONFIG_SDMMC1/2_SDIO_PULLUP
 *      If you are using an external SDCard module that does not have the
 *      pull-up resistors for the SDIO interface (like the Gadgeteer SD Card
 *      Module) then enable this option to activate the internal pull-up
 *      resistors.
 */

/* If there are 2 SDMMC enabled, then Slot 0 is SDMMC1, and Slot 1 is SDMMC2
 * If there is only 1 SDMMC, then Slot 0 is assigned to the defined SDMMC
 * hence, if only SDMMC2 is defined it will be slot 0.
 */

#if !defined(CONFIG_STM32_SDMMC1)
#  define SDMMC2_SLOT  0
#else
#  define SDMMC2_SLOT  1
#endif

#if !defined(CONFIG_STM32_SDMMC_IDMA)
#  warning "Large Non-DMA transfer may result in RX overrun failures"
#elif defined(CONFIG_STM32_SDMMC1)
#  define STM32H5_SRAM_START  STM32_SRAM1_BASE
#  define STM32H5_SRAM_END    (STM32_SRAM3_BASE + STM32_SRAM3_SIZE)
#endif

#ifndef CONFIG_SCHED_WORKQUEUE
#  error "Callback support requires CONFIG_SCHED_WORKQUEUE"
#endif

#undef HAVE_SDMMC_SDIO_MODE
#if defined(CONFIG_SDMMC1_SDIO_MODE) || defined(CONFIG_SDMMC2_SDIO_MODE)
#  define HAVE_SDMMC_SDIO_MODE
#endif

#if !defined(CONFIG_DEBUG_FS) || !defined(CONFIG_DEBUG_FEATURES)
#  undef CONFIG_STM32_SDMMC_XFRDEBUG
#endif

#ifdef CONFIG_SDMMC1_SDIO_PULLUP
#  define SDMMC1_SDIO_PULL(g)  (((g) & ~GPIO_PUPD_MASK) | GPIO_PULLUP)
#else
#  define SDMMC1_SDIO_PULL(g)  (((g) & ~GPIO_PUPD_MASK) | GPIO_FLOAT)
#endif

#ifdef CONFIG_SDMMC2_SDIO_PULLUP
#  define SDMMC2_SDIO_PULL(g)  (((g) & ~GPIO_PUPD_MASK) | GPIO_PULLUP)
#else
#  define SDMMC2_SDIO_PULL(g)  (((g) & ~GPIO_PUPD_MASK) | GPIO_FLOAT)
#endif

/* Define the Hardware FIFO size */

#define FIFO_SIZE_IN_BYTES        64

/* Friendly Clock source & CLKCR bit re-definitions *************************/

/* If not set in board use default pll1_q_ck clock is selected as
 * kernel peripheral clock (default after reset)
 */

#if !defined(STM32_RCC_D1CCIPR_SDMMCSEL)
#  define STM32_RCC_D1CCIPR_SDMMCSEL  RCC_CCIPR4_SDMMC1SEL
#endif

