apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
#if STM32_RCC_D1CCIPR_SDMMCSEL  == RCC_CCIPR4_SDMMC1SEL
#  define STM32_SDMMC_CLK  STM32_PLL1Q_FREQUENCY
#else
#  define STM32_SDMMC_CLK  STM32_PLL2R_FREQUENCY
#endif

#define STM32_CLKCR_RISINGEDGE    (0)
#define STM32_CLKCR_FALLINGEDGE   STM32_SDMMC_CLKCR_NEGEDGE

/* Use the default of the rising edge but allow a configuration,
 * that does not have the errata, to override the edge the SDIO
 * command and data is changed on.
 */

#if !defined(STM32_SDMMC_CLKCR_EDGE)
#  define STM32_SDMMC_CLKCR_EDGE STM32_CLKCR_RISINGEDGE
#endif

/* Mode dependent settings.  These depend on clock divisor settings that must
 * be defined in the board-specific board.h header file:
 * STM32_SDMMC_INIT_CLKDIV, STM32_SDMMC_MMCXFR_CLKDIV, and
 * STM32_SDMMC_SDXFR_CLKDIV.
 */

#define STM32_CLCKCR_INIT           (STM32_SDMMC_INIT_CLKDIV      |     \
                                     STM32_SDMMC_CLKCR_EDGE       |     \
                                     STM32_SDMMC_CLKCR_WIDBUS_D1)
#define STM32_SDMMC_CLKCR_MMCXFR    (STM32_SDMMC_MMCXFR_CLKDIV    |     \
                                     STM32_SDMMC_CLKCR_EDGE       |     \
                                     STM32_SDMMC_CLKCR_PWRSAV     |     \
                                     STM32_SDMMC_CLKCR_WIDBUS_D1)
#define STM32_SDMMC_CLCKR_SDXFR     (STM32_SDMMC_SDXFR_CLKDIV     |     \
                                     STM32_SDMMC_CLKCR_EDGE       |     \
                                     STM32_SDMMC_CLKCR_PWRSAV     |     \
                                     STM32_SDMMC_CLKCR_WIDBUS_D1)
#ifdef HAVE_SDMMC_SDIO_MODE
/* Do not enable power saving configuration bit (in SD 4-bit mode) because
 * the SDIO clock is not enabled when the bus goes to the idle state.
 * This condition breaks interrupts delivering mechanism over DAT[1]/IRQ
 * SDIO line to the host.
 */
#  define STM32_SDMMC_CLCKR_SDWIDEXFR (STM32_SDMMC_SDXFR_CLKDIV     |     \
                                       STM32_SDMMC_CLKCR_EDGE       |     \
                                       STM32_SDMMC_CLKCR_WIDBUS_D4)
#else
#  define STM32_SDMMC_CLCKR_SDWIDEXFR (STM32_SDMMC_SDXFR_CLKDIV     |     \
                                       STM32_SDMMC_CLKCR_EDGE       |     \
                                       STM32_SDMMC_CLKCR_PWRSAV     |     \
                                       STM32_SDMMC_CLKCR_WIDBUS_D4)
#endif

/* Timing */

#define SDMMC_CMDTIMEOUT         (100000)
#define SDMMC_LONGTIMEOUT        (0x7fffffff)

/* DTIMER setting */

#define SDMMC_DTIMER_DATATIMEOUT_MS  250

/* Block size for multi-block transfers */

#define SDMMC_MAX_BLOCK_SIZE          (512)

/* Data transfer interrupt mask bits */

/* DMA interrupts */

#define STM32_SDMMC_DMARECV_MASK  (STM32_SDMMC_MASK_DCRCFAILIE |        \
                                   STM32_SDMMC_MASK_DTIMEOUTIE |        \
                                   STM32_SDMMC_MASK_DATAENDIE  |        \
                                   STM32_SDMMC_MASK_RXOVERRIE)

#define STM32_SDMMC_DMASEND_MASK  (STM32_SDMMC_MASK_DCRCFAILIE |        \
                                   STM32_SDMMC_MASK_DTIMEOUTIE |        \
                                   STM32_SDMMC_MASK_DATAENDIE  |        \
                                   STM32_SDMMC_MASK_TXUNDERRIE)
#define STM32_SDMMC_XFRDONE_MASK  (0)

/* Interrupt mode */

#define STM32_SDMMC_RECV_MASK     (STM32_SDMMC_MASK_DCRCFAILIE |        \
                                   STM32_SDMMC_MASK_DTIMEOUTIE |        \
                                   STM32_SDMMC_MASK_DATAENDIE  |        \
                                   STM32_SDMMC_MASK_RXOVERRIE  |        \
                                   STM32_SDMMC_MASK_RXFIFOHFIE)

#define STM32_SDMMC_SEND_MASK     (STM32_SDMMC_MASK_DCRCFAILIE |        \
                                   STM32_SDMMC_MASK_DTIMEOUTIE |        \
                                   STM32_SDMMC_MASK_DATAENDIE  |        \
                                   STM32_SDMMC_MASK_TXFIFOHEIE |        \
                                   STM32_SDMMC_MASK_TXUNDERRIE)

/* Event waiting interrupt mask bits */

#define STM32_SDMMC_CMDDONE_STA   (STM32_SDMMC_STA_CMDSENT)

#define STM32_SDMMC_RESPDONE_STA  (STM32_SDMMC_STA_CTIMEOUT |    \
                                   STM32_SDMMC_STA_CCRCFAIL |    \
                                   STM32_SDMMC_STA_CMDREND)

#define STM32_SDMMC_CMDDONE_MASK  (STM32_SDMMC_MASK_CMDSENTIE)

#define STM32_SDMMC_RESPDONE_MASK (STM32_SDMMC_MASK_CCRCFAILIE | \
                                   STM32_SDMMC_MASK_CTIMEOUTIE | \
                                   STM32_SDMMC_MASK_CMDRENDIE)

#define STM32_SDMMC_XFRDONE_MASK  (0)

#define STM32_SDMMC_CMDDONE_ICR   (STM32_SDMMC_ICR_CMDSENTC |    \
                                   STM32_SDMMC_ICR_DBCKENDC)

#define STM32_SDMMC_RESPDONE_ICR  (STM32_SDMMC_ICR_CTIMEOUTC |   \
                                   STM32_SDMMC_ICR_CCRCFAILC |   \
                                   STM32_SDMMC_ICR_CMDRENDC  |   \
                                   STM32_SDMMC_ICR_DBCKENDC)

#define STM32_SDMMC_XFRDONE_ICR   (STM32_SDMMC_ICR_DATAENDC  |   \
                                   STM32_SDMMC_ICR_DCRCFAILC |   \
                                   STM32_SDMMC_ICR_DTIMEOUTC |   \
                                   STM32_SDMMC_ICR_RXOVERRC  |   \
                                   STM32_SDMMC_ICR_TXUNDERRC |   \
                                   STM32_SDMMC_ICR_DBCKENDC)

#define STM32_SDMMC_WAITALL_ICR   (STM32_SDMMC_CMDDONE_ICR   |   \
                                   STM32_SDMMC_RESPDONE_ICR  |   \
                                   STM32_SDMMC_XFRDONE_ICR   |   \
                                   STM32_SDMMC_ICR_DBCKENDC)

/* Let's wait until we have both SDIO transfer complete and DMA complete. */

#define SDMMC_XFRDONE_FLAG  (1)
#define SDMMC_DMADONE_FLAG  (2)
#define SDMMC_ALLDONE       (3)

/* Register logging support */

#if defined(CONFIG_STM32_SDMMC_XFRDEBUG)
#  define SAMPLENDX_BEFORE_SETUP  0
#  define SAMPLENDX_AFTER_SETUP   1
#  define SAMPLENDX_END_TRANSFER  2
#  define DEBUG_NSAMPLES          3
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure defines the state of the STM32 SDMMC interface */

struct stm32_dev_s
{
  struct sdio_dev_s  dev;             /* Standard, base SDIO interface */

  /* STM32-specific extensions */

  uint32_t          base;
  int               nirq;
#if defined(CONFIG_MMCSD_SDIOWAIT_WRCOMPLETE)
  uint32_t          d0_gpio;
#endif

