apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
static void stm32_callback(void *arg);
static void stm32_default(struct stm32_dev_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/
#if defined(CONFIG_STM32_SDMMC1)
struct stm32_dev_s g_sdmmcdev1 =
{
  .dev =
  {
#if defined(CONFIG_SDIO_MUXBUS)
    .lock             = stm32_lock,
#endif
    .reset            = stm32_reset,
    .capabilities     = stm32_capabilities,
    .status           = stm32_status,
    .widebus          = stm32_widebus,
    .clock            = stm32_clock,
    .attach           = stm32_attach,
    .sendcmd          = stm32_sendcmd,
    .blocksetup       = stm32_blocksetup,
#if defined(CONFIG_STM32_SDMMC_IDMA)
    .recvsetup        = stm32_dmarecvsetup,
    .sendsetup        = stm32_dmasendsetup,
#else
    .recvsetup        = stm32_recvsetup,
    .sendsetup        = stm32_sendsetup,
#endif
    .cancel           = stm32_cancel,
    .waitresponse     = stm32_waitresponse,
    .recv_r1          = stm32_recvshortcrc,
    .recv_r2          = stm32_recvlong,
    .recv_r3          = stm32_recvshort,
    .recv_r4          = stm32_recvshort,
    .recv_r5          = stm32_recvshortcrc,
    .recv_r6          = stm32_recvshortcrc,
    .recv_r7          = stm32_recvshort,
    .waitenable       = stm32_waitenable,
    .eventwait        = stm32_eventwait,
    .callbackenable   = stm32_callbackenable,
    .registercallback = stm32_registercallback,
#if defined(CONFIG_STM32_SDMMC_IDMA)
#  if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
    .dmapreflight     = stm32_dmapreflight,
#  endif
    .dmarecvsetup     = stm32_dmarecvsetup,
    .dmasendsetup     = stm32_dmasendsetup,
#endif
  },
  .base               = STM32_SDMMC1_BASE,
  .nirq               = STM32_IRQ_SDMMC1,
#if defined(CONFIG_MMCSD_SDIOWAIT_WRCOMPLETE)
  .d0_gpio            = SDMMC1_SDIO_PULL(GPIO_SDMMC1_D0),
#endif
  .waitsem            = SEM_INITIALIZER(0),
#if defined(HAVE_SDMMC_SDIO_MODE) && defined(CONFIG_SDMMC1_SDIO_MODE)
  .sdiomode           = true,
#endif
};
#endif
#if defined(CONFIG_STM32_SDMMC2)
struct stm32_dev_s g_sdmmcdev2 =
{
  .dev =
  {
#if defined(CONFIG_SDIO_MUXBUS)
    .lock             = stm32_lock,
#endif
    .reset            = stm32_reset,
    .capabilities     = stm32_capabilities,
    .status           = stm32_status,
    .widebus          = stm32_widebus,
    .clock            = stm32_clock,
    .attach           = stm32_attach,
    .sendcmd          = stm32_sendcmd,
    .blocksetup       = stm32_blocksetup,
#if defined(CONFIG_STM32_SDMMC_IDMA)
    .recvsetup        = stm32_dmarecvsetup,
    .sendsetup        = stm32_dmasendsetup,
#else
    .recvsetup        = stm32_recvsetup,
    .sendsetup        = stm32_sendsetup,
#endif
    .cancel           = stm32_cancel,
    .waitresponse     = stm32_waitresponse,
    .recv_r1          = stm32_recvshortcrc,
    .recv_r2          = stm32_recvlong,
    .recv_r3          = stm32_recvshort,
    .recv_r4          = stm32_recvshort,
    .recv_r5          = stm32_recvshortcrc,
    .recv_r6          = stm32_recvshortcrc,
    .recv_r7          = stm32_recvshort,
    .waitenable       = stm32_waitenable,
    .eventwait        = stm32_eventwait,
    .callbackenable   = stm32_callbackenable,
    .registercallback = stm32_registercallback,
#if defined(CONFIG_STM32_SDMMC_IDMA)
#  if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
    .dmapreflight     = stm32_dmapreflight,
#  endif
    .dmarecvsetup     = stm32_dmarecvsetup,
    .dmasendsetup     = stm32_dmasendsetup,
#endif
  },
  .base               = STM32_SDMMC2_BASE,
  .nirq               = STM32_IRQ_SDMMC2,
#if defined(CONFIG_MMCSD_SDIOWAIT_WRCOMPLETE)
  .d0_gpio            = SDMMC2_SDIO_PULL(GPIO_SDMMC2_D0),
#endif
  .waitsem            = SEM_INITIALIZER(0),
#if defined(HAVE_SDMMC_SDIO_MODE) && defined(CONFIG_SDMMC2_SDIO_MODE)
  .sdiomode           = true,
#endif
};
#endif
/* Register logging support */

#if defined(CONFIG_STM32_SDMMC_XFRDEBUG)
static struct stm32_sampleregs_s g_sampleregs[DEBUG_NSAMPLES];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sdmmc_putreg32
 ****************************************************************************/

static inline void sdmmc_putreg32(struct stm32_dev_s *priv, uint32_t value,
                                  int offset)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: sdmmc_gettreg32
 ****************************************************************************/

static inline uint32_t sdmmc_getreg32(struct stm32_dev_s *priv, int offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: sdmmc_modifyreg32
 ****************************************************************************/

static inline void sdmmc_modifyreg32(struct stm32_dev_s *priv, int offset,
                                     uint32_t clearbits, uint32_t setbits)
{
  irqstate_t flags;
  int32_t   regval;

  flags   = enter_critical_section();
  regval  = getreg32(priv->base + offset);
  regval &= ~clearbits;
  regval |= setbits;
  putreg32(regval, priv->base + offset);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: stm32_setclkcr
 *
 * Description:
 *   Modify oft-changed bits in the CLKCR register.  Only the following bit-
 *   fields are changed:
 *
 *   CLKDIV, PWRSAV, BYPASS, WIDBUS, NEGEDGE, and HWFC_EN
 *
 * Input Parameters:
 *   priv       - Instance of the SDMMC private state structure.
 *   clkcr - A new CLKCR setting for the above mentions bits (other bits
 *           are ignored.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_setclkcr(struct stm32_dev_s *priv, uint32_t clkcr)
{
  uint32_t regval = sdmmc_getreg32(priv, STM32_SDMMC_CLKCR_OFFSET);

  /* Clear CLKDIV, PWRSAV, WIDBUS, NEGEDGE, HWFC_EN bits */

  regval &= ~(STM32_SDMMC_CLKCR_CLKDIV_MASK | STM32_SDMMC_CLKCR_PWRSAV      |
              STM32_SDMMC_CLKCR_WIDBUS_MASK | STM32_SDMMC_CLKCR_NEGEDGE     |
              STM32_SDMMC_CLKCR_HWFC_EN     | STM32_SDMMC_CLKCR_DDR         |
              STM32_SDMMC_CLKCR_BUS_SPEED   |
              STM32_SDMMC_CLKCR_SELCLKRX_MASK);

