apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
#if defined(CONFIG_STM32_SDMMC_XFRDEBUG)
static void stm32_sample(struct stm32_dev_s *priv, int index)
{
  struct stm32_sampleregs_s *regs = &g_sampleregs[index];

  stm32_sdiosample(priv, &regs->sdio);
}
#endif

/****************************************************************************
 * Name: stm32_sdiodump
 *
 * Description:
 *   Dump one register sample
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_SDMMC_XFRDEBUG)
static void stm32_sdiodump(struct stm32_sdioregs_s *regs, const char *msg)
{
  mcinfo("SDIO Registers: %s\n", msg);
  mcinfo("  POWER[%08x]: %08" PRIx8 "\n", STM32_SDMMC_POWER_OFFSET,
         regs->power);
  mcinfo("  CLKCR[%08x]: %08" PRIx16 "\n", STM32_SDMMC_CLKCR_OFFSET,
         regs->clkcr);
  mcinfo("  DCTRL[%08x]: %08" PRIx16 "\n", STM32_SDMMC_DCTRL_OFFSET,
         regs->dctrl);
  mcinfo(" DTIMER[%08x]: %08" PRIx32 "\n", STM32_SDMMC_DTIMER_OFFSET,
         regs->dtimer);
  mcinfo("   DLEN[%08x]: %08" PRIx32 "\n", STM32_SDMMC_DLEN_OFFSET,
         regs->dlen);
  mcinfo(" DCOUNT[%08x]: %08" PRIx32 "\n", STM32_SDMMC_DCOUNT_OFFSET,
         regs->dcount);
  mcinfo("    STA[%08x]: %08" PRIx32 "\n", STM32_SDMMC_STA_OFFSET,
         regs->sta);
  mcinfo("   MASK[%08x]: %08" PRIx32 "\n", STM32_SDMMC_MASK_OFFSET,
         regs->mask);
}
#endif

/****************************************************************************
 * Name: stm32_dumpsample
 *
 * Description:
 *   Dump one register sample
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_SDMMC_XFRDEBUG)
static void stm32_dumpsample(struct stm32_dev_s *priv,
                             struct stm32_sampleregs_s *regs,
                             const char *msg)
{
  stm32_sdiodump(&regs->sdio, msg);
}
#endif

/****************************************************************************
 * Name: stm32_dumpsamples
 *
 * Description:
 *   Dump all sampled register data
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_SDMMC_XFRDEBUG)
static void stm32_dumpsamples(struct stm32_dev_s *priv)
{
  stm32_dumpsample(priv, &g_sampleregs[SAMPLENDX_BEFORE_SETUP],
                   "Before setup");
  stm32_dumpsample(priv, &g_sampleregs[SAMPLENDX_AFTER_SETUP],
                   "After setup");
  stm32_dumpsample(priv, &g_sampleregs[SAMPLENDX_END_TRANSFER],
                   "End of transfer");
}
#endif

/****************************************************************************
 * Name: stm32_log2
 *
 * Description:
 *   Take (approximate) log base 2 of the provided number (Only works if the
 *   provided number is a power of 2).
 *
 ****************************************************************************/

static uint8_t stm32_log2(uint16_t value)
{
  uint8_t log2 = 0;

  /* 0000 0000 0000 0001 -> return 0,
   * 0000 0000 0000 001x -> return 1,
   * 0000 0000 0000 01xx -> return 2,
   * 0000 0000 0000 1xxx -> return 3,
   * ...
   * 1xxx xxxx xxxx xxxx -> return 15,
   */

  DEBUGASSERT(value > 0);
  while (value != 1)
    {
      value >>= 1;
      log2++;
    }

  return log2;
}

/****************************************************************************
 * Name: stm32_dataconfig
 *
 * Description:
 *   Configure the SDIO data path for the next data transfer
 *
 ****************************************************************************/

static void stm32_dataconfig(struct stm32_dev_s *priv, uint32_t timeout,
                             uint32_t dlen, bool receive)
{
  uint32_t clkdiv;
  uint32_t regval;
  uint32_t dctrl;
  uint32_t sdio_clk = STM32_SDMMC_CLK;

  DEBUGASSERT((sdmmc_getreg32(priv, STM32_SDMMC_IDMACTRLR_OFFSET) &
               STM32_SDMMC_IDMACTRLR_IDMAEN) == 0);
  DEBUGASSERT((sdmmc_getreg32(priv, STM32_SDMMC_STA_OFFSET) &
               STM32_SDMMC_STA_DPSMACT) == 0);

  /* Configure DCTRL DTDIR, DTMODE, and DBLOCKSIZE fields.
   * Note: the DTEN is not used, DPSM, and CPSM are used.
   */

  dctrl  =  sdmmc_getreg32(priv, STM32_SDMMC_DCTRL_OFFSET);
  dctrl  &= ~(STM32_SDMMC_DCTRL_DTDIR | STM32_SDMMC_DCTRL_DTMODE_MASK |
              STM32_SDMMC_DCTRL_DBLOCKSIZE_MASK | STM32_SDMMC_DCTRL_DTEN |
              STM32_SDMMC_DCTRL_BOOTACKEN);

  dctrl  &= (STM32_SDMMC_DCTRL_DTDIR | STM32_SDMMC_DCTRL_DTMODE_MASK |
             STM32_SDMMC_DCTRL_DBLOCKSIZE_MASK);

  /* Configure the data direction */

  if (receive)
    {
      dctrl |= STM32_SDMMC_DCTRL_DTDIR;
    }

  /* Set SDIO_MODE */

#if defined(HAVE_SDMMC_SDIO_MODE)
  if (priv->sdiomode == true)
    {
      dctrl |= STM32_SDMMC_DCTRL_SDIOEN;
    }
#endif

  /* Select DTMODE:
   * - CMD53 byte mode: nblocks=1, blocksize = actual byte count < 128
   *   -> use DTMODE_SDIO (SDIO multibyte), matching bare-metal
   *   TRANSFER_MODE_SDIO
   * - CMD53 block mode: blocksize = registered block size (128 for CC33xx)
   *   -> use DTMODE_BLOCK for per-block CRC checking
   * Threshold 128 = CC33xx registered Fn2 block size. Byte mode transfers
   * always have blocksize < 128 because the CMD53 byte count is < 128.
   */

#if defined(HAVE_SDMMC_SDIO_MODE)
  if (priv->sdiomode && priv->nblocks == 1 && priv->blocksize < 128)
    {
      dctrl |= STM32_SDMMC_DCTRL_DTMODE_SDIO;   /* CMD53 byte/multibyte mode */
    }
  else
#endif
    {
      dctrl |= STM32_SDMMC_DCTRL_DTMODE_BLOCK;
    }

  /* if dlen > priv->blocksize we assume that this is a multi-block transfer
   * and that the len is multiple of priv->blocksize.
   */

  if (dlen > priv->blocksize)
    {
      DEBUGASSERT((dlen % priv->blocksize) == 0);

#if defined(CONFIG_STM32_SDMMC_IDMA)
      /* If this is an unaligned receive, then receive one block at a
       * time to the internal buffer
       */

      if (priv->unaligned_rx)
        {
          dlen = priv->blocksize;
        }
#endif
    }

  dctrl |= stm32_log2(priv->blocksize) << STM32_SDMMC_DCTRL_DBLOCKSIZE_SHIFT;

  /* Enable data path */

  /* Set DTIMER
   *
   * Enable data path using a timeout scaled to the SD_CLOCK (the card
   * clock).
   */

  regval = sdmmc_getreg32(priv, STM32_SDMMC_CLKCR_OFFSET);
  clkdiv = (regval & STM32_SDMMC_CLKCR_CLKDIV_MASK) >>
            STM32_SDMMC_CLKCR_CLKDIV_SHIFT;

