apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
      up_invalidate_dcache((uintptr_t)priv->sdmmc_rxbuffer,
                           (uintptr_t)priv->sdmmc_rxbuffer +
                           priv->blocksize);

      /* Update how much there is left to receive */

      priv->remaining -= priv->blocksize;
    }
  else
    {
      /* In an aligned case, we have always received all blocks.
       *
       * The destination buffer was invalidated before the DMA in
       * stm32_dmarecvsetup(), but the cache can speculatively prefetch
       * into this (cacheable) buffer between that point and DMA
       * completion, leaving stale lines that shadow the data just
       * written by the IDMA. Invalidate again now that the transfer is
       * complete, before the buffer is consumed, so the CPU reads the
       * freshly received data instead of a previously cached sector.
       * The buffer and length are cache-line aligned here (that is why
       * this aligned path was taken), so no adjacent memory is affected.
       */

      up_invalidate_dcache((uintptr_t)priv->buffer,
                           (uintptr_t)priv->buffer + priv->receivecnt);

      priv->remaining = 0;
    }

  if (priv->remaining == 0)
    {
      /* no data remaining, end the transfer */

      stm32_endtransfer(priv, SDIOWAIT_TRANSFERDONE);
    }
  else
    {
      /* We end up here only in unaligned rx-buffers case, and are receiving
       * the data one block at a time
       */

      /* Update where to receive the following block */

      priv->buffer = (uint32_t *)((uintptr_t)priv->buffer + priv->blocksize);

      /* Clear pending interrupt status */

      sdmmc_putreg32(priv, STM32_SDMMC_XFRDONE_ICR, STM32_SDMMC_ICR_OFFSET);

      /* Re-enable datapath and wait for next block */

      dctrl = sdmmc_getreg32(priv, STM32_SDMMC_DCTRL_OFFSET);
      dctrl |= STM32_SDMMC_DCTRL_DTEN;
      sdmmc_putreg32(priv, dctrl, STM32_SDMMC_DCTRL_OFFSET);
    }
}
#endif

/****************************************************************************
 * Name: stm32_eventtimeout
 *
 * Description:
 *   The watchdog timeout setup when the event wait start has expired without
 *   any other waited-for event occurring.
 *
 * Input Parameters:
 *   arg    - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void stm32_eventtimeout(wdparm_t arg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)arg;

  /* There is always race conditions with timer expirations. */

  DEBUGASSERT((priv->waitevents & SDIOWAIT_TIMEOUT) != 0 ||
              priv->wkupevent != 0);

  mcinfo("sta: %08" PRIx32 " enabled irq: %08" PRIx32 "\n",
         sdmmc_getreg32(priv, STM32_SDMMC_STA_OFFSET),
         sdmmc_getreg32(priv, STM32_SDMMC_MASK_OFFSET));

  /* Is a data transfer complete event expected? */

  if ((priv->waitevents & SDIOWAIT_TIMEOUT) != 0)
    {
      /* Yes.. wake up any waiting threads */

#ifdef CONFIG_MMCSD_SDIOWAIT_WRCOMPLETE
      stm32_endwait(priv, SDIOWAIT_TIMEOUT |
                    (priv->waitevents & SDIOWAIT_WRCOMPLETE));
#else
      stm32_endwait(priv, SDIOWAIT_TIMEOUT);
#endif
      mcerr("Timeout: remaining: %zu\n", priv->remaining);
    }
}

/****************************************************************************
 * Name: stm32_endwait
 *
 * Description:
 *   Wake up a waiting thread if the waited-for event has occurred.
 *
 * Input Parameters:
 *   priv  - Instance of the SDMMC private state structure.
 *   wkupevent - The event that caused the wait to end
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void stm32_endwait(struct stm32_dev_s *priv,
                          sdio_eventset_t wkupevent)
{
  /* Cancel the watchdog timeout */

  wd_cancel(&priv->waitwdog);

  /* Disable event-related interrupts */

  stm32_configwaitints(priv, 0, 0, wkupevent);

  /* Wake up the waiting thread */

  nxsem_post(&priv->waitsem);
}

/****************************************************************************
 * Name: stm32_endtransfer
 *
 * Description:
 *   Terminate a transfer with the provided status.  This function is called
 *   only from the SDIO interrupt handler when end-of-transfer conditions
 *   are detected.
 *
 * Input Parameters:
 *   priv  - Instance of the SDMMC private state structure.
 *   wkupevent - The event that caused the transfer to end
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void stm32_endtransfer(struct stm32_dev_s *priv,
                              sdio_eventset_t wkupevent)
{
  /* Disable all transfer related interrupts */

  stm32_configxfrints(priv, 0);

  /* If there were errors, send a stop command to DPSM */

  if ((wkupevent & (~SDIOWAIT_TRANSFERDONE)) != 0)
    {
      sdmmc_putreg32(priv, STM32_SDMMC_CMD_CMDSTOP,
                     STM32_SDMMC_CMD_OFFSET);
    }
  else
    {
      sdmmc_modifyreg32(priv, STM32_SDMMC_CMD_OFFSET,
                        STM32_SDMMC_CMD_CPSMEN, 0);
    }

  /* Clearing pending interrupt status on all transfer related interrupts */

  sdmmc_putreg32(priv, STM32_SDMMC_XFRDONE_ICR, STM32_SDMMC_ICR_OFFSET);

  /* DMA debug instrumentation */

  stm32_sample(priv, SAMPLENDX_END_TRANSFER);

  /* Mark the transfer finished */

  priv->remaining = 0;

  /* Is a thread wait for these data transfer complete events? */

  if ((priv->waitevents & wkupevent) != 0)
    {
      /* Yes.. wake up any waiting threads */

      stm32_endwait(priv, wkupevent);
    }
}

/****************************************************************************
 * Name: stm32_sdmmc_fifo_monitor
 *
 * Description:
 *   SDMMC FIFO monitor is used to detect the FIFO is stalled with less
 *   than FIFO_SIZE_IN_BYTES /2 that will trigger an interrupt.
 *
 * Input Parameters:
 *   arg - is the stm32_dev_s
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

