apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
#if !defined(CONFIG_STM32_SDMMC_IDMA)
static void stm32_sdmmc_fifo_monitor(void *arg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)arg;

  if (priv->receivecnt && priv->remaining &&
      priv->remaining < FIFO_SIZE_IN_BYTES / 2)
    {
      /* Manually Receive data from the lame RX FIFO */

      stm32_recvfifo(priv);
    }

  /* Check for the lame FIFO condition */

  if (sdmmc_getreg32(priv, STM32_SDMMC_DCOUNT_OFFSET) != 0 &&
      sdmmc_getreg32(priv, STM32_SDMMC_STA_OFFSET) ==
      STM32_SDMMC_STA_DPSMACT)
    {
      work_queue(HPWORK, &priv->cbfifo,
                 stm32_sdmmc_fifo_monitor, arg, 1);
    }
}
#endif

/****************************************************************************
 * Name: stm32_sdmmc[1|2]_rdyinterrupt
 *
 * Description:
 *   SDMMC ready interrupt handler
 *
 * Input Parameters:
 *   irq     - not used
 *   context - not used
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#if defined(CONFIG_MMCSD_SDIOWAIT_WRCOMPLETE)
static int stm32_sdmmc_rdyinterrupt(int irq, void *context, void *arg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)arg;

  /* Avoid noise, check the state */

  if (stm32_gpioread(priv->d0_gpio))
    {
      stm32_endwait(priv, SDIOWAIT_WRCOMPLETE);
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_sdmmc_interrupt
 *
 * Description:
 *   SDMMC interrupt handler
 *
 * Input Parameters:
 *   priv  - Instance of the SDMMC private state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static int stm32_sdmmc_interrupt(int irq, void *context, void *arg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)arg;
  uint32_t enabled;
  uint32_t pending;
#if defined(HAVE_SDMMC_SDIO_MODE)
  uint32_t mask;
#endif

  DEBUGASSERT(priv != NULL);

  /* Loop while there are pending interrupts.  Check the SDIO status
   * register.  Mask out all bits that don't correspond to enabled
   * interrupts.  (This depends on the fact that bits are ordered
   * the same in both the STA and MASK register).  If there are non-zero
   * bits remaining, then we have work to do here.
   */

  while ((enabled = sdmmc_getreg32(priv, STM32_SDMMC_STA_OFFSET) &
          sdmmc_getreg32(priv, STM32_SDMMC_MASK_OFFSET)) != 0)
    {
      /* Handle in progress, interrupt driven data transfers ****************/

      pending  = enabled & priv->xfrmask;
      if (pending != 0)
        {
#ifndef CONFIG_STM32_SDMMC_IDMA
          /* Is the RX FIFO half full or more?  Is so then we must be
           * processing a receive transaction.
           */

          if ((pending & STM32_SDMMC_STA_RXFIFOHF) != 0)
            {
              /* Receive data from the RX FIFO */

              stm32_recvfifo(priv);
              work_queue(HPWORK, &priv->cbfifo,
                         stm32_sdmmc_fifo_monitor, arg, 1);
            }

          /* Otherwise, Is the transmit FIFO half empty or less?  If so
           * we must be processing a send transaction.  NOTE:  We can't
           * be processing both!
           */

          else if ((pending & STM32_SDMMC_STA_TXFIFOHE) != 0)
            {
              /* Send data via the TX FIFO */

              stm32_sendfifo(priv);

              /* If we are done shutdown the TXFIFOHE interrupt */

              if (priv->remaining == 0)
                {
                  sdmmc_putreg32(priv, ~STM32_SDMMC_MASK_TXFIFOHEIE &
                                 sdmmc_getreg32(priv,
                                                STM32_SDMMC_MASK_OFFSET),
                                 STM32_SDMMC_MASK_OFFSET);
                }
            }
#endif

          /* Handle data end events */

          if ((pending & STM32_SDMMC_STA_DATAEND) != 0)
            {
              /* Handle any data remaining the RX FIFO.  If the RX FIFO is
               * less than half full at the end of the transfer, then no
               * half-full interrupt will be received.
               */

#ifndef CONFIG_STM32_SDMMC_IDMA

              /* If the transfer would not trigger fifo half full
               * we used IDMA to manage the lame fifo
               */

              if (priv->remaining && priv->remaining <
                  FIFO_SIZE_IN_BYTES / 2)
                {
                  memcpy(priv->buffer, priv->rxfifo, priv->remaining);
                }
#else
              if (priv->receivecnt)
                {
                  /* Invalidate dcache, and copy the received data into
                   * client buffers in unaligned case
                   */

                  stm32_recvdma(priv);
                }
              else
#endif
                {
                  /* Then terminate the transfer.
                   * Sets STM32_SDMMC_ICR_DATAENDC
                   */

                  stm32_endtransfer(priv, SDIOWAIT_TRANSFERDONE);
                }
            }

          /* Handle data block send/receive CRC failure */

          else if ((pending & STM32_SDMMC_STA_DCRCFAIL) != 0)
            {
              /* Terminate the transfer with an error.
               *  Sets STM32_SDMMC_ICR_DCRCFAILC
               */

              mcerr("ERROR: Data block CRC failure, remaining: %u\n",
                    priv->remaining);

              stm32_endtransfer(priv,
                                SDIOWAIT_TRANSFERDONE | SDIOWAIT_ERROR);
            }

          /* Handle data timeout error */

          else if ((pending & STM32_SDMMC_STA_DTIMEOUT) != 0)
            {
              /* Terminate the transfer with an error
               *  Sets STM32_SDMMC_ICR_DTIMEOUTC
               */

              mcerr("ERROR: Data timeout, remaining: %u\n",
                    priv->remaining);

              stm32_endtransfer(priv, SDIOWAIT_TRANSFERDONE |
                                      SDIOWAIT_TIMEOUT);
            }

          /* Handle RX FIFO overrun error */

