apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
          else if ((pending & STM32_SDMMC_STA_RXOVERR) != 0)
            {
              /* Terminate the transfer with an error
               * Sets STM32_SDMMC_ICR_RXOVERRC
               */

              mcerr("ERROR: RX FIFO overrun, remaining: %u\n",
                    priv->remaining);

              stm32_endtransfer(priv, SDIOWAIT_TRANSFERDONE |
                                      SDIOWAIT_ERROR);
            }

          /* Handle TX FIFO underrun error */

          else if ((pending & STM32_SDMMC_STA_TXUNDERR) != 0)
            {
              /* Terminate the transfer with an error
               * Sets STM32_SDMMC_ICR_TXUNDERRC
               */

              mcerr("ERROR: TX FIFO underrun, remaining: %u\n",
                    priv->remaining);

              stm32_endtransfer(priv, SDIOWAIT_TRANSFERDONE |
                                      SDIOWAIT_ERROR);
            }
        }

      /* Handle wait events *************************************************/

      pending  = enabled & priv->waitmask;
      if (pending != 0)
        {
          /* Is this a response completion event? */

          if ((pending & STM32_SDMMC_RESPDONE_STA) != 0)
            {
              sdmmc_putreg32(priv, STM32_SDMMC_RESPDONE_STA,
                             STM32_SDMMC_ICR_OFFSET);

              /* Yes.. Is there a thread waiting for response done? */

              if ((priv->waitevents & SDIOWAIT_RESPONSEDONE) != 0)
                {
                  /* Yes.. wake the thread up */

                  stm32_endwait(priv, SDIOWAIT_RESPONSEDONE);
                }
            }

          /* Is this a command completion event? */

          if ((pending & STM32_SDMMC_CMDDONE_STA) != 0)
            {
              sdmmc_putreg32(priv, STM32_SDMMC_CMDDONE_STA,
                             STM32_SDMMC_ICR_OFFSET);

              /* Yes.. Is there a thread waiting for command done? */

              if ((priv->waitevents & SDIOWAIT_RESPONSEDONE) != 0)
                {
                  /* Yes.. wake the thread up */

                  stm32_endwait(priv, SDIOWAIT_CMDDONE);
                }
            }
        }

#if defined(HAVE_SDMMC_SDIO_MODE)
      if (priv->sdiomode == true)
        {
          pending = enabled & priv->sdiointmask;
          if (pending != 0)
            {
              mask = sdmmc_getreg32(priv, STM32_SDMMC_MASK_OFFSET);

              /* Clear the mask so we don't get call'd again */

              sdmmc_putreg32(priv, mask & ~STM32_SDMMC_MASK_SDIOITIE,
                             STM32_SDMMC_MASK_OFFSET);

              /* Now clear the interruption */

              sdmmc_putreg32(priv, STM32_SDMMC_ICR_SDIOITC,
                             STM32_SDMMC_ICR_OFFSET);

              /* Call the ISR that has been registered */

              if (priv->do_sdio_card)
                {
                  priv->do_sdio_card(priv->do_sdio_arg);
                }
            }
        }
#endif
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_lock
 *
 * Description:
 *   Locks the bus. Function calls low-level multiplexed bus routines to
 *   resolve bus requests and acknowledgment issues.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   lock   - TRUE to lock, FALSE to unlock.
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#if defined(CONFIG_SDIO_MUXBUS)
static int stm32_lock(struct sdio_dev_s *dev, bool lock)
{
  /* The multiplex bus is part of board support package. */

  /* FIXME: Implement the below function to support bus share:
   *
   * stm32_muxbus_sdio_lock(dev, lock);
   */

  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_reset
 *
 * Description:
 *   Reset the SDIO controller.  Undo all setup and initialization.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_reset(struct sdio_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;
  irqstate_t flags;
  uint32_t regval;
  uint32_t regaddress;
  uint32_t restval;

  /* Disable clocking */

  flags = enter_critical_section();

#if defined(CONFIG_STM32_SDMMC1)
  if (priv->base == STM32_SDMMC1_BASE)
    {
      regaddress = STM32_RCC_AHB4RSTR;
      restval    = RCC_AHB4RSTR_SDMMC1RST;
    }
#endif

#if defined CONFIG_STM32_SDMMC2
  if (priv->base == STM32_SDMMC2_BASE)
    {
      regaddress = STM32_RCC_AHB4RSTR;
      restval    = RCC_AHB4RSTR_SDMMC2RST;
    }
#endif

  regval = getreg32(regaddress);
  putreg32(regval | restval, regaddress);
  nxsig_usleep(2);
  putreg32(regval, regaddress);

  stm32_setpwrctrl(priv, STM32_SDMMC_POWER_PWRCTRL_CYCLE);
  nxsig_usleep(1000);

  /* Put SDIO registers in their default, reset state */

  stm32_default(priv);

  /* Reset data */

  priv->waitevents = 0;      /* Set of events to be waited for */
  priv->waitmask   = 0;      /* Interrupt enables for event waiting */
  priv->wkupevent  = 0;      /* The event that caused the wakeup */

  wd_cancel(&priv->waitwdog); /* Cancel any timeouts */

  /* Interrupt mode data transfer support */

  priv->buffer     = 0;      /* Address of current R/W buffer */
  priv->remaining  = 0;      /* Number of bytes remaining in the transfer */
  priv->xfrmask    = 0;      /* Interrupt enables for data transfer */

#ifdef HAVE_SDMMC_SDIO_MODE
  priv->sdiointmask = 0;     /* SDIO card in-band interrupt mask */
#endif

  priv->widebus    = false;

  /* Configure the SDIO peripheral */

  stm32_setpwrctrl(priv, STM32_SDMMC_POWER_PWRCTRL_OFF);
  nxsig_usleep(1000);
  stm32_setpwrctrl(priv, STM32_SDMMC_POWER_PWRCTRL_ON);

  stm32_setclkcr(priv, STM32_CLCKCR_INIT);

  leave_critical_section(flags);

  mcinfo("CLCKR: %08" PRIx32 " POWER: %08" PRIx32 "\n",
         sdmmc_getreg32(priv, STM32_SDMMC_CLKCR_OFFSET),
         sdmmc_getreg32(priv, STM32_SDMMC_POWER_OFFSET));
}

/****************************************************************************
 * Name: stm32_capabilities
 *
 * Description:
 *   Get capabilities (and limitations) of the SDIO driver (optional)
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *
 * Returned Value:
 *   Returns a bitset of status values (see SDIO_CAPS_* defines)
 *
 ****************************************************************************/

static sdio_capset_t stm32_capabilities(struct sdio_dev_s *dev)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;
  sdio_capset_t caps = 0;

  if (priv->onebit)
    {
      caps |= SDIO_CAPS_1BIT_ONLY;
    }

