apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
  return 0;
}
#endif

/****************************************************************************
 * Name: stm32_dmarecvsetup
 *
 * Description:
 *   Setup to perform a read DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For read transfers this may mean
 *   invalidating the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - The memory to DMA from
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_SDMMC_IDMA)
static int stm32_dmarecvsetup(struct sdio_dev_s *dev,
                              uint8_t *buffer, size_t buflen)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  /* If the previous transfer left the DPSM active, force hardware and
   * software state cleanup before starting a new transfer.
   */

  uint32_t sta = sdmmc_getreg32(priv, STM32_SDMMC_STA_OFFSET);

  if (sta & STM32_SDMMC_STA_DPSMACT)
    {
      mcwarn("WARNING: DPSM still active (STA=0x%08" PRIx32
             "), forcing cleanup\n", sta);

      /* Step 1: Disable IDMA (must precede DCTRL clear) */

      sdmmc_putreg32(priv, 0, STM32_SDMMC_IDMACTRLR_OFFSET);

      /* Step 2: Stop DPSM by clearing DCTRL */

      sdmmc_putreg32(priv, 0, STM32_SDMMC_DCTRL_OFFSET);

      /* Step 3: Clear DLEN */

      sdmmc_putreg32(priv, 0, STM32_SDMMC_DLEN_OFFSET);

      /* Step 4: Clear all interrupt flags */

      sdmmc_putreg32(priv, STM32_SDMMC_ICR_ALLFLAGS,
                     STM32_SDMMC_ICR_OFFSET);

      /* Step 5: Wait for DPSMACT to deassert */

      int timeout = 1000;

      while ((sdmmc_getreg32(priv, STM32_SDMMC_STA_OFFSET) &
              STM32_SDMMC_STA_DPSMACT) && --timeout > 0)
        {
          up_udelay(1);
        }

      if (timeout == 0)
        {
          mcerr("ERROR: DPSMACT won't clear, FIFO reset\n");
          sdmmc_putreg32(priv, STM32_SDMMC_DCTRL_FIFORST,
                         STM32_SDMMC_DCTRL_OFFSET);
          up_udelay(10);
          sdmmc_putreg32(priv, 0, STM32_SDMMC_DCTRL_OFFSET);
          sdmmc_putreg32(priv, STM32_SDMMC_ICR_ALLFLAGS,
                         STM32_SDMMC_ICR_OFFSET);
        }

      /* Step 6: Reset driver internal state */

      stm32_configxfrints(priv, 0);
      priv->remaining  = 0;
      priv->receivecnt = 0;
      priv->waitevents = 0;
      priv->wkupevent  = 0;
      priv->buffer     = NULL;

      /* Step 7: Restore DTIMER */

      sdmmc_putreg32(priv, UINT32_MAX, STM32_SDMMC_DTIMER_OFFSET);
    }

  DEBUGASSERT(priv != NULL && buffer != NULL && buflen > 0);
#if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
  DEBUGASSERT(stm32_dmapreflight(dev, buffer, buflen) == 0);
#endif

#if defined(CONFIG_ARMV8M_DCACHE)
  if (((uintptr_t)buffer & (ARMV8M_DCACHE_LINESIZE - 1)) != 0 ||
       (buflen & (ARMV8M_DCACHE_LINESIZE - 1)) != 0)
    {
      /* The read buffer is not cache-line aligned. Read to an internal
       * buffer instead.
       */

      up_invalidate_dcache((uintptr_t)priv->sdmmc_rxbuffer,
                           (uintptr_t)priv->sdmmc_rxbuffer +
                           priv->blocksize);

      priv->unaligned_rx = true;
    }
  else
    {
      up_invalidate_dcache((uintptr_t)buffer,
                           (uintptr_t)buffer + buflen);

      priv->unaligned_rx = false;
    }
#else

  /* IDMA access must be 32 bit aligned */

  priv->unaligned_rx = ((uintptr_t)buffer & 0x3) != 0;

#endif

  /* Reset the DPSM configuration */

  stm32_datadisable(priv);

  /* Initialize register sampling */

  stm32_sampleinit();
  stm32_sample(priv, SAMPLENDX_BEFORE_SETUP);

  /* Save the destination buffer information for use by the interrupt
   * handler.
   */

  priv->buffer      = (uint32_t *)buffer;
  priv->remaining  = buflen;
  priv->receivecnt = buflen;

  /* Then set up the SDIO data path */

  stm32_dataconfig(priv, SDMMC_DTIMER_DATATIMEOUT_MS, buflen, true);

  /* Configure the RX DMA */

  if (priv->unaligned_rx)
    {
      sdmmc_putreg32(priv, (uintptr_t)priv->sdmmc_rxbuffer,
                     STM32_SDMMC_IDMABASE0R_OFFSET);
    }
  else
    {
      sdmmc_putreg32(priv, (uintptr_t)priv->buffer,
                     STM32_SDMMC_IDMABASE0R_OFFSET);
    }

  sdmmc_putreg32(priv, STM32_SDMMC_IDMACTRLR_IDMAEN,
                 STM32_SDMMC_IDMACTRLR_OFFSET);

  /* And enable interrupts */

  stm32_configxfrints(priv, STM32_SDMMC_DMARECV_MASK);

  stm32_sample(priv, SAMPLENDX_AFTER_SETUP);
  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_dmasendsetup
 *
 * Description:
 *   Setup to perform a write DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For write transfers, this may mean
 *   flushing the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - The memory to DMA into
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#if defined(CONFIG_STM32_SDMMC_IDMA)
static int stm32_dmasendsetup(struct sdio_dev_s *dev,
                              const uint8_t *buffer, size_t buflen)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)dev;

  DEBUGASSERT(priv != NULL && buffer != NULL && buflen > 0);
#if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
  DEBUGASSERT(stm32_dmapreflight(dev, buffer, buflen) == 0);
#endif

  priv->unaligned_rx = false;

  /* Reset the DPSM configuration */

  stm32_datadisable(priv);

  /* Initialize register sampling */

  stm32_sampleinit();
  stm32_sample(priv, SAMPLENDX_BEFORE_SETUP);

  /* Flush cache to physical memory when not in DTCM memory */

#if defined(CONFIG_ARMV8M_DCACHE) && \
      !defined(CONFIG_ARMV8M_DCACHE_WRITETHROUGH)
  up_clean_dcache((uintptr_t)buffer, (uintptr_t)buffer + buflen);
#endif

