apache/nuttx/arch/arm/src/stm32h5/stm32_sdmmc.c
  /* Save the source buffer information for use by the interrupt handler */

  priv->buffer     = (uint32_t *)buffer;
  priv->remaining  = buflen;
  priv->receivecnt = 0;

  /* Then set up the SDIO data path */

  stm32_dataconfig(priv, SDMMC_DTIMER_DATATIMEOUT_MS, buflen, false);

  /* Configure the TX DMA */

  sdmmc_putreg32(priv, (uintptr_t)priv->buffer,
                 STM32_SDMMC_IDMABASE0R_OFFSET);

  sdmmc_putreg32(priv, STM32_SDMMC_IDMACTRLR_IDMAEN,
                 STM32_SDMMC_IDMACTRLR_OFFSET);

  /* Enable TX interrupts */

  stm32_configxfrints(priv, STM32_SDMMC_DMASEND_MASK);
  stm32_sample(priv, SAMPLENDX_AFTER_SETUP);
  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_callback
 *
 * Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void stm32_callback(void *arg)
{
  struct stm32_dev_s *priv = (struct stm32_dev_s *)arg;

  /* Is a callback registered? */

  DEBUGASSERT(priv != NULL);
  mcinfo("Callback %p(%p) cbevents: %02" PRIx8 " cdstatus: %02" PRIx8 "\n",
         priv->callback, priv->cbarg, priv->cbevents, priv->cdstatus);

  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * the callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt
       * handler.  If we are in an interrupt handler, then queue the
       * callback to be performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

          mcinfo("Queuing callback to %p(%p)\n",
                 priv->callback, priv->cbarg);

          work_queue(HPWORK, &priv->cbwork, priv->callback,
                     priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n", priv->callback, priv->cbarg);
          priv->callback(priv->cbarg);
        }
    }
}

/****************************************************************************
 * Name: stm32_default
 *
 * Description:
 *   Restore SDIO registers to their default, reset values
 *
 ****************************************************************************/

static void stm32_default(struct stm32_dev_s *priv)
{
  sdmmc_putreg32(priv, STM32_SDMMC_POWER_RESET,  STM32_SDMMC_POWER_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_CLKCR_RESET,  STM32_SDMMC_CLKCR_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_ARG_RESET,    STM32_SDMMC_ARG_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_CMD_RESET,    STM32_SDMMC_CMD_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_DTIMER_RESET, STM32_SDMMC_DTIMER_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_DLEN_RESET,   STM32_SDMMC_DLEN_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_DCTRL_RESET,  STM32_SDMMC_DCTRL_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_ICR_RESET,    STM32_SDMMC_ICR_OFFSET);
  sdmmc_putreg32(priv, STM32_SDMMC_MASK_RESET,   STM32_SDMMC_MASK_OFFSET);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sdio_initialize
 *
 * Description:
 *   Initialize SDIO for operation.
 *
 * Input Parameters:
 *   slotno - Not used.
 *
 * Returned Values:
 *   A reference to an SDIO interface structure.  NULL is returned on
 *   failures.
 *
 ****************************************************************************/

struct sdio_dev_s *sdio_initialize(int slotno)
{
  struct stm32_dev_s *priv = NULL;

#if defined(CONFIG_STM32_SDMMC1)
  if (slotno == 0)
    {
      /* Select SDMMC 1 */

      priv = &g_sdmmcdev1;

      /* REVISIT: hack for now to avoid sorting out the DMA's reach */

      priv->sdmmc_rxbuffer = (uint8_t *)kmm_memalign(ARMV8M_DCACHE_LINESIZE,
                                                      SDMMC_MAX_BLOCK_SIZE);

#if defined(CONFIG_SDMMC1_WIDTH_D1_ONLY)
      priv->onebit = true;
#else
      priv->onebit = false;
#endif

      /* Configure GPIOs for 4-bit, wide-bus operation (the chip is capable
       * of 8-bit wide bus operation but D4-D7 are not configured).
       *
       * If bus is multiplexed then there is a custom bus configuration
       * utility in the scope of the board support package.
       */

#ifndef CONFIG_SDIO_MUXBUS
      stm32_configgpio(SDMMC1_SDIO_PULL(GPIO_SDMMC1_D0));
#  ifndef CONFIG_SDMMC1_WIDTH_D1_ONLY
      stm32_configgpio(SDMMC1_SDIO_PULL(GPIO_SDMMC1_D1));
      stm32_configgpio(SDMMC1_SDIO_PULL(GPIO_SDMMC1_D2));
      stm32_configgpio(SDMMC1_SDIO_PULL(GPIO_SDMMC1_D3));
#  endif
      stm32_configgpio(GPIO_SDMMC1_CK);
      stm32_configgpio(SDMMC1_SDIO_PULL(GPIO_SDMMC1_CMD));
#endif
    }
  else
#endif
#if defined(CONFIG_STM32_SDMMC2)
  if (slotno == SDMMC2_SLOT)
    {
      /* Select SDMMC 2 */

      priv = &g_sdmmcdev2;

      /* REVISIT: hack for now to avoid sorting out the DMA's reach */

      priv->sdmmc_rxbuffer = (uint8_t *)kmm_memalign(ARMV8M_DCACHE_LINESIZE,
                                                      SDMMC_MAX_BLOCK_SIZE);

#  if defined(CONFIG_SDMMC2_WIDTH_D1_ONLY)
      priv->onebit = true;
#  else
      priv->onebit = false;
#  endif

